In [4]:
import pandas as pd
import numpy as np

In [5]:
pd.isnull(np.nan)

True

In [6]:
pd.isnull(None)

True

In [7]:
pd.isna(np.nan)

True

In [8]:
pd.isna(None)

True

opposite of it

In [9]:
pd.notnull(None)

False

In [10]:
pd.notnull(np.nan)

False

In [11]:
pd.notnull(3)

True

functions works with series and data frame

In [12]:
pd.isnull(pd.Series([1, np.nan, 7]))

0    False
1     True
2    False
dtype: bool

In [13]:
pd.notnull(pd.Series([1, np.nan, 7]))

0     True
1    False
2     True
dtype: bool

In [14]:
pd.isnull(pd.DataFrame({
    'Column A': [1, np.nan, 7],
    'Column B': [np.nan, 2, 3],
    'Column C': [np.nan, 2, np.nan]
}))

   Column A  Column B  Column C
0     False      True      True
1      True     False     False
2     False     False      True

PANDAS OPERATING WT MISSING VALUES

In [15]:
pd.Series([1, 2, np.nan]).count()

2

In [16]:
pd.Series([1, 2, np.nan]).sum()

3.0

In [17]:
pd.Series([2, 2, np.nan]).mean()

2.0

FILTERING MISSING DATA

# With numpy we can conbime boolean selection + pd.isnull to filter out those nan s and null values:

In [18]:
s = pd.Series([1, 2, 3, np.nan, np.nan, 4])
pd.notnull(s)

0     True
1     True
2     True
3    False
4    False
5     True
dtype: bool

In [19]:
pd.notnull(s).count()

6

In [20]:
pd.notnull(s).sum()

4

In [21]:
pd.isnull(s).sum()

2

In [22]:
s[pd.notnull(s)]

0    1.0
1    2.0
2    3.0
5    4.0
dtype: float64

both notnull and isnull are method of series and dataframe s, so we could use it that way

In [23]:
s.isnull()

0    False
1    False
2    False
3     True
4     True
5    False
dtype: bool

In [24]:
s.notnull()

0     True
1     True
2     True
3    False
4    False
5     True
dtype: bool

In [25]:
s[s.notnull()]

0    1.0
1    2.0
2    3.0
5    4.0
dtype: float64

DROPING NULL VALUES

boolean selection + notnull() seems a bit verbose and repitative, and as we said b4 any repitative task will probably have a metter, more DRY way.in this case we can use the dropna method.

In [26]:
s

0    1.0
1    2.0
2    3.0
3    NaN
4    NaN
5    4.0
dtype: float64

In [27]:
s.dropna()

0    1.0
1    2.0
2    3.0
5    4.0
dtype: float64

DATAFRAME

In [28]:
df = pd.DataFrame({
    'Column A': [1, np.nan, 30, np.nan],
    'Column B': [2, 8, 31, np.nan],
    'Column C': [np.nan, 9, 32, 100],
    'Column D': [5, 8, 34, 110]
})
df

   Column A  Column B  Column C  Column D
0       1.0       2.0       NaN         5
1       NaN       8.0       9.0         8
2      30.0      31.0      32.0        34
3       NaN       NaN     100.0       110

In [29]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 4 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Column A  2 non-null      float64
 1   Column B  3 non-null      float64
 2   Column C  3 non-null      float64
 3   Column D  4 non-null      int64
dtypes: float64(3), int64(1)
memory usage: 256.0 bytes

In [30]:
df.shape

(4, 4)

In [31]:
df.isnull()

   Column A  Column B  Column C  Column D
0     False     False      True     False
1      True     False     False     False
2     False     False     False     False
3      True      True     False     False

In [32]:
df.isnull().sum()

Column A    2
Column B    1
Column C    1
Column D    0
dtype: int64

the dropna fun will drop the row in which null is present

In [33]:
df.dropna()

   Column A  Column B  Column C  Column D
2      30.0      31.0      32.0        34

In [34]:
df.dropna(axis = 1)

   Column D
0         5
1         8
2        34
3       110

any or all drops the row or columns that has at least one null value

In [35]:
df2 = pd.DataFrame({
    'Column A': [1, np.nan, 30,],
    'Column B': [2, np.nan, 31],
    'Column C': [np.nan, np.nan, 100],
})
df2

   Column A  Column B  Column C
0       1.0       2.0       NaN
1       NaN       NaN       NaN
2      30.0      31.0     100.0

In [36]:
df.dropna(how='all')

   Column A  Column B  Column C  Column D
0       1.0       2.0       NaN         5
1       NaN       8.0       9.0         8
2      30.0      31.0      32.0        34
3       NaN       NaN     100.0       110

In [37]:
df.dropna(how='any')

   Column A  Column B  Column C  Column D
2      30.0      31.0      32.0        34

can use thersh parameter to indicate a thershold ( a minimun number) of non-null values fpr the rows/columns to be kept

In [38]:
df

   Column A  Column B  Column C  Column D
0       1.0       2.0       NaN         5
1       NaN       8.0       9.0         8
2      30.0      31.0      32.0        34
3       NaN       NaN     100.0       110

In [39]:
df.dropna(thresh=3)

   Column A  Column B  Column C  Column D
0       1.0       2.0       NaN         5
1       NaN       8.0       9.0         8
2      30.0      31.0      32.0        34

In [40]:
df.dropna(thresh=3, axis = 'columns')

   Column B  Column C  Column D
0       2.0       NaN         5
1       8.0       9.0         8
2      31.0      32.0        34
3       NaN     100.0       110

FILLING NULL VALUES

sometimes instead of droppin we might repalce them but depending on ur context and dataset. some times nan can be replace with 0 or mean of the sample.ot yhe coolest value

In [41]:
s

0    1.0
1    2.0
2    3.0
3    NaN
4    NaN
5    4.0
dtype: float64

filling nan wt abitrary value

In [42]:
s.fillna(0)

0    1.0
1    2.0
2    3.0
3    0.0
4    0.0
5    4.0
dtype: float64

In [43]:
s.fillna(s.mean())

0    1.0
1    2.0
2    3.0
3    2.5
4    2.5
5    4.0
dtype: float64

In [44]:
s

0    1.0
1    2.0
2    3.0
3    NaN
4    NaN
5    4.0
dtype: float64

filling null wt contigiuous (close) values

the method is used to fill null with value close to that null one:

In [45]:
s.fillna(method='ffill')

0    1.0
1    2.0
2    3.0
3    3.0
4    3.0
5    4.0
dtype: float64

In [46]:
s.fillna(method='bfill')

0    1.0
1    2.0
2    3.0
3    4.0
4    4.0
5    4.0
dtype: float64

can leave null values at the extreames of the Series/DataFrame

In [47]:
pd.Series([np.nan, 3, np.nan, 9]).fillna(method='ffill')

0    NaN
1    3.0
2    3.0
3    9.0
dtype: float64

In [48]:
pd.Series([1, np.nan, 3, np.nan, np.nan]).fillna(method='bfill')

0    1.0
1    3.0
2    3.0
3    NaN
4    NaN
dtype: float64

filling null value on DataFrame

In [49]:
df.fillna({'Column A': 0, 'Column B': 99, 'Column C': df['Column C'].mean()})

   Column A  Column B  Column C  Column D
0       1.0       2.0      47.0         5
1       0.0       8.0       9.0         8
2      30.0      31.0      32.0        34
3       0.0      99.0     100.0       110

In [50]:
df.fillna(method='ffill', axis = 0)

   Column A  Column B  Column C  Column D
0       1.0       2.0       NaN         5
1       1.0       8.0       9.0         8
2      30.0      31.0      32.0        34
3      30.0      31.0     100.0       110

In [51]:
df.fillna(method='ffill', axis = 1)

   Column A  Column B  Column C  Column D
0       1.0       2.0       2.0       5.0
1       NaN       8.0       9.0       8.0
2      30.0      31.0      32.0      34.0
3       NaN       NaN     100.0     110.0

CHEACKING IF THERE IS NA

cheaking if series or data contain missing values then it returns true or false

In [52]:
df = pd.DataFrame({
    'Sex': ['M', 'F', 'F', 'D', '?'],
    'Age': [29, 30, 24, 290, 25]
})
df

  Sex  Age
0   M   29
1   F   30
2   F   24
3   D  290
4   ?   25

fillig unique value

In [53]:
df['Sex'].unique()

array(['M', 'F', 'D', '?'], dtype=object)

In [54]:
df['Sex'].value_counts()

F    2
M    1
D    1
?    1
Name: Sex, dtype: int64

In [55]:
df['Sex'].replace('D', 'F')

0    M
1    F
2    F
3    F
4    ?
Name: Sex, dtype: object

In [56]:
df['Sex'].replace({'D': 'F', 'N': 'M'})

0    M
1    F
2    F
3    F
4    ?
Name: Sex, dtype: object

In [57]:
df.replace({
    'Sex': {'D' : 'F',
            'N' : 'M'
           },
    'Age': {290 : 29
           }
})

  Sex  Age
0   M   29
1   F   30
2   F   24
3   F   29
4   ?   25

In [58]:
df[df['Age'] > 100]

  Sex  Age
3   D  290

In [59]:
df.loc[df['Age'] > 100, 'Age'] = df.loc[df['Age'] > 100, 'Age'] / 10

In [60]:
df

  Sex   Age
0   M  29.0
1   F  30.0
2   F  24.0
3   D  29.0
4   ?  25.0

DUPLICATE

In [61]:
import numpy as np
import pandas as pd

In [62]:
ambassadors = pd.Series([
    'France',
    'United Kingdom',
    'United Kingdom',
    'Italy',
    'Germany',
    'Germany',
    'Germany',
],  index=[
    'Gerard Araud',
    'Kim Darroch',
    'Peter Westmacott',
    'Armando Varricchio',
    'Peter Wittig',
    'Peter Ammon',
    'Klaus Scharioth',
])

In [63]:
ambassadors

Gerard Araud                  France
Kim Darroch           United Kingdom
Peter Westmacott      United Kingdom
Armando Varricchio             Italy
Peter Wittig                 Germany
Peter Ammon                  Germany
Klaus Scharioth              Germany
dtype: object

In [64]:
ambassadors.duplicated()

Gerard Araud          False
Kim Darroch           False
Peter Westmacott       True
Armando Varricchio    False
Peter Wittig          False
Peter Ammon            True
Klaus Scharioth        True
dtype: bool

In [65]:
ambassadors.duplicated(keep = 'last')

Gerard Araud          False
Kim Darroch            True
Peter Westmacott      False
Armando Varricchio    False
Peter Wittig           True
Peter Ammon            True
Klaus Scharioth       False
dtype: bool

In [66]:
ambassadors.duplicated(keep = False)

Gerard Araud          False
Kim Darroch            True
Peter Westmacott       True
Armando Varricchio    False
Peter Wittig           True
Peter Ammon            True
Klaus Scharioth        True
dtype: bool

In [67]:
ambassadors.drop_duplicates()

Gerard Araud                  France
Kim Darroch           United Kingdom
Armando Varricchio             Italy
Peter Wittig                 Germany
dtype: object

In [68]:
ambassadors.drop_duplicates(keep = 'last')

Gerard Araud                  France
Peter Westmacott      United Kingdom
Armando Varricchio             Italy
Klaus Scharioth              Germany
dtype: object

In [69]:
ambassadors.drop_duplicates(keep = False)

Gerard Araud          France
Armando Varricchio     Italy
dtype: object

DUPLICATES IN DATAFRAME

In [70]:
players = pd.DataFrame({
    'Name': [
        'Kobe Bryant',
        'Lebron James',
         'Kobe Bryant',
        'Carmelo Anthony',
         'Kobe Bryant',
    ],
    'Pos' :[
        'SG', 
        'SF',
        'SG',
        'SF',
        'SF'
    ]
})

In [71]:
players

              Name Pos
0      Kobe Bryant  SG
1     Lebron James  SF
2      Kobe Bryant  SG
3  Carmelo Anthony  SF
4      Kobe Bryant  SF

In [72]:
players.duplicated()

0    False
1    False
2     True
3    False
4    False
dtype: bool

In [73]:
players.duplicated(subset =['Name'], keep = 'last')

0     True
1    False
2     True
3    False
4    False
dtype: bool

In [74]:
players.drop_duplicates()

              Name Pos
0      Kobe Bryant  SG
1     Lebron James  SF
3  Carmelo Anthony  SF
4      Kobe Bryant  SF

In [75]:
players.drop_duplicates(subset =['Name'])

              Name Pos
0      Kobe Bryant  SG
1     Lebron James  SF
3  Carmelo Anthony  SF

In [76]:
players.drop_duplicates(subset =['Name'], keep = 'last')

              Name Pos
1     Lebron James  SF
3  Carmelo Anthony  SF
4      Kobe Bryant  SF

In [77]:
df = pd.DataFrame({
    'Data' :[
    '1987_M_US _1',
    '1990?_M_US_1',
    '1992_F_US_2',
    '1970_M_    IT_1',
    '1985_F_I  T_2'
]})

In [78]:
df

              Data
0     1987_M_US _1
1     1990?_M_US_1
2      1992_F_US_2
3  1970_M_    IT_1
4    1985_F_I  T_2

In [79]:
df['Data'].str.split('_')

0       [1987, M, US , 1]
1       [1990?, M, US, 1]
2        [1992, F, US, 2]
3    [1970, M,     IT, 1]
4      [1985, F, I  T, 2]
Name: Data, dtype: object

In [80]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 1 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Data    5 non-null      object
dtypes: object(1)
memory usage: 168.0+ bytes

In [81]:
df['Data'].str.split('_', expand = True)

       0  1       2  3
0   1987  M     US   1
1  1990?  M      US  1
2   1992  F      US  2
3   1970  M      IT  1
4   1985  F    I  T  2

In [82]:
df = df['Data'].str.split('_', expand = True)

In [83]:
df.columns = ['Year', 'Sex', 'Country', 'No Children']

can cheack which column contain a given value

In [84]:
df

    Year Sex Country No Children
0   1987   M     US            1
1  1990?   M      US           1
2   1992   F      US           2
3   1970   M      IT           1
4   1985   F    I  T           2

In [85]:
df['Year'].str.contains('/?')

0    True
1    True
2    True
3    True
4    True
Name: Year, dtype: bool

In [86]:
df['Year'].str.contains('U')

0    False
1    False
2    False
3    False
4    False
Name: Year, dtype: bool

In [87]:
df['Year'].str.strip('/?')

0    1987
1    1990
2    1992
3    1970
4    1985
Name: Year, dtype: object

In [88]:
df['Country'].str.replace(' ',  '')

0    US
1    US
2    US
3    IT
4    IT
Name: Country, dtype: object

In [89]:
df['Year'].str.replace(r'(?P<year>\d{4})\?', lambda m: m.group ('year'))

<ipython-input-89-20bbe2c61cb3>:1: FutureWarning: The default value of regex will change from True to False in a future version.
  df['Year'].str.replace(r'(?P<year>\d{4})\?', lambda m: m.group ('year'))

0    1987
1    1990
2    1992
3    1970
4    1985
Name: Year, dtype: object

importing data set

In [90]:
import pandas as pd
df = pd.read_csv("C:\\Users\\phera\\Desktop\\datasets\\train.csv")
df

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [91]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [92]:
df.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [93]:
df.columns.str.lower()

Index(['passengerid', 'survived', 'pclass', 'name', 'sex', 'age', 'sibsp',
       'parch', 'ticket', 'fare', 'cabin', 'embarked'],
      dtype='object')

In [94]:
df.rename(columns= {'PassengerId' : 'Passenger_Id', 'Pclass' : 'P_class', 'Name' : 'Full_Name'} )

,Passenger_Id,Survived,P_class,Full_Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [95]:
df.rename(columns= {'PassengerId' : 'Passenger_Id', 'Pclass' : 'P_class',  'Name' : 'Full_Name'}, inplace =True)

In [96]:
df.Full_Name

0                                Braund, Mr. Owen Harris
1      Cumings, Mrs. John Bradley (Florence Briggs Th...
2                                 Heikkinen, Miss. Laina
3           Futrelle, Mrs. Jacques Heath (Lily May Peel)
4                               Allen, Mr. William Henry
                             ...
886                                Montvila, Rev. Juozas
887                         Graham, Miss. Margaret Edith
888             Johnston, Miss. Catherine Helen "Carrie"
889                                Behr, Mr. Karl Howell
890                                  Dooley, Mr. Patrick
Name: Full_Name, Length: 891, dtype: object

In [97]:
df.Full_Name.str.split(" ")

0                           [Braund,, Mr., Owen, Harris]
1      [Cumings,, Mrs., John, Bradley, (Florence, Bri...
2                             [Heikkinen,, Miss., Laina]
3      [Futrelle,, Mrs., Jacques, Heath, (Lily, May, ...
4                          [Allen,, Mr., William, Henry]
                             ...
886                            [Montvila,, Rev., Juozas]
887                    [Graham,, Miss., Margaret, Edith]
888       [Johnston,, Miss., Catherine, Helen, "Carrie"]
889                           [Behr,, Mr., Karl, Howell]
890                              [Dooley,, Mr., Patrick]
Name: Full_Name, Length: 891, dtype: object

In [98]:
df.Full_Name.str.split(" ").str.get(0)

0         Braund,
1        Cumings,
2      Heikkinen,
3       Futrelle,
4          Allen,
          ...
886     Montvila,
887       Graham,
888     Johnston,
889         Behr,
890       Dooley,
Name: Full_Name, Length: 891, dtype: object

In [99]:
df['Full_Name'] = df.Full_Name.str.split(" ").str.get(0)

In [100]:
df['Full_Name'].str.split(" ").str.get(4)

0     NaN
1     NaN
2     NaN
3     NaN
4     NaN
       ..
886   NaN
887   NaN
888   NaN
889   NaN
890   NaN
Name: Full_Name, Length: 891, dtype: float64